[{
  "_id": {
    "$oid": "68794c75f7b5a17c45808ac4"
  },
  "name": "Diploma in Full Stack Development",
  "fees": 18000,
  "type": "Diploma",
  "discount": 38,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "28",
  "ratings": 4.6,
  "description": "The Diploma in Full Stack Development is an immersive and comprehensive program designed to equip learners with the technical skills and practical knowledge needed to build dynamic, responsive, and fully functional web applications from end to end. This course covers both front-end and back-end technologies, offering a complete understanding of the development lifecycle. Learners gain hands-on experience in designing user interfaces, managing databases, and developing APIs—key components of modern web ecosystems.\n\nIn this course, students begin with Front-End Development, learning HTML5, CSS3, and responsive design principles. They develop a solid foundation in JavaScript, from basics to advanced concepts, and explore modern frameworks like React.js or Angular. The curriculum also emphasizes UI/UX best practices and version control using Git and GitHub, promoting clean, collaborative coding workflows.\n\nThe Back-End Development module focuses on server-side programming using Node.js with Express.js or Python with Django. Students learn to build RESTful APIs, handle routing, manage files, and implement secure user authentication and authorization systems.\n\nFor Database Management, learners work with both relational databases such as MySQL or PostgreSQL and NoSQL databases like MongoDB. They practice performing CRUD operations and designing effective data models that support real-world applications.\n\nIn the DevOps and Deployment segment, students deploy their applications using cloud platforms like Heroku, AWS, or Netlify. They become familiar with continuous integration/continuous deployment (CI/CD) pipelines, environment variable configurations, and essential debugging and testing techniques.\n\nFinally, the program culminates in Capstone Projects, where learners build and deploy full stack applications inspired by real-world use cases such as e-commerce stores, blogs, or personal portfolio platforms. These projects encourage collaborative coding using version control and team workflows, ensuring students graduate with the experience needed to succeed in professional development environments.",
  "template_image": "https://ik.imagekit.io/iufkpclvp/full-stack_zdqsMH9uH.jpg",
  "createdAt": {
    "$date": "2025-07-17T19:18:13.922Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687960979a9ac7907d451a92"
  },
  "name": "Diploma in MS Office",
  "fees": 8100,
  "type": "Diploma",
  "discount": 60,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "8",
  "ratings": 4.2,
  "description": "The Diploma in MS Office is a foundational program designed to provide practical skills in Microsoft Office applications, widely used in workplaces, educational institutions, and business environments. This course covers the core tools—MS Word, Excel, PowerPoint, and Outlook—focusing on real-world tasks like document creation, data analysis, presentation design, and professional email communication.\n\nWhether you're a student, job seeker, or working professional, this course helps you become confident and efficient in handling daily digital tasks and boosts your productivity with hands-on training and guided practice.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/ms-office_8xoP9bMxu.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:44:08.118Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687961429a9ac7907d451a9a"
  },
  "name": "Diploma in AI / Copilot",
  "fees": 18000,
  "type": "Diploma",
  "discount": 69,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "8",
  "ratings": 4.3,
  "description": "The Diploma in AI & Copilot is a future-focused program designed to introduce learners to the transformative power of Artificial Intelligence (AI) and AI-assisted tools like GitHub Copilot, ChatGPT, and other productivity-boosting copilots. This course blends foundational AI concepts with hands-on experience using modern AI assistants in coding, writing, customer support, automation, and more.\n\nIdeal for both tech-savvy individuals and professionals looking to modernize their workflows, the course emphasizes how to effectively collaborate with AI tools to boost creativity, productivity, and efficiency across a variety of industries.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/content-writing_6HDZ87w12.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:46:58.446Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6879619a9a9ac7907d451aa2"
  },
  "name": "Diploma in Java Full Stack",
  "fees": 18000,
  "type": "Diploma",
  "discount": 49,
  "course_level": "Advanced",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "24",
  "ratings": 4.5,
  "description": "The Diploma in Java Full Stack Development is a career-focused program that trains learners in both front-end and back-end technologies using Java as the core programming language. This course takes you through building complete web applications—right from creating responsive user interfaces to developing robust server-side logic and managing databases.\n\nYou'll learn to work with essential tools and frameworks such as HTML, CSS, JavaScript, Spring Boot, Hibernate, and MySQL, giving you the skills required to become a job-ready full stack Java developer. By the end of the course, you'll be able to develop, deploy, and maintain end-to-end web solutions independently or as part of a development team.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/java-fullstack_L81jJIwNQ.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:48:26.481Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687961ee9a9ac7907d451aaa"
  },
  "name": "Diploma in IOT",
  "fees": 18000,
  "type": "Diploma",
  "discount": 69,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "23",
  "ratings": 4.2,
  "description": "The Diploma in IoT is a hands-on, career-oriented program that introduces learners to the rapidly evolving world of connected devices and smart technologies. IoT combines sensors, hardware, software, and cloud computing to create intelligent systems that can monitor, collect, and exchange data in real time. This course equips students with the technical knowledge and practical skills needed to design, build, and deploy IoT solutions for industries such as smart homes, healthcare, agriculture, manufacturing, and more.\n\nThrough a combination of theoretical concepts and real-world projects, learners will gain a deep understanding of IoT architecture, device programming, data handling, and cloud integration.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/IOT_eqJ2Ar_Vq.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:49:50.930Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687962459a9ac7907d451ab2"
  },
  "name": "Diploma in Cloud Computing",
  "fees": 18000,
  "type": "Diploma",
  "discount": 69,
  "course_level": "Advanced",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "17",
  "ratings": 4.8,
  "description": "The Diploma in Cloud Computing is a comprehensive training program designed to equip learners with the essential skills and knowledge needed to work with cloud-based technologies and services. This course covers cloud computing fundamentals, infrastructure, deployment models, and service platforms such as Amazon Web Services (AWS), Microsoft Azure, and Google Cloud Platform (GCP).\n\nThrough practical labs, real-world scenarios, and hands-on projects, students will learn how to build, manage, and secure scalable cloud applications. The course also introduces containerization, DevOps practices, and cloud security essentials—making it ideal for individuals aiming for careers in cloud architecture, system administration, or DevOps engineering.",
  "template_image": "https://ik.imagekit.io/iufkpclvp/cloud-computing_Dt9OmVIni.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:51:17.465Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687962ae9a9ac7907d451aba"
  },
  "name": "Diploma in Cyber Security",
  "fees": 18000,
  "type": "Diploma",
  "discount": 49,
  "course_level": "Advanced",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "23",
  "ratings": 4.2,
  "description": "The Diploma in Cyber Security is a comprehensive program designed to provide learners with the technical expertise and practical skills needed to protect systems, networks, and data from cyber threats. With an increasing demand for digital security across all sectors, this course equips you to understand, identify, and mitigate security risks using industry-standard tools and methodologies.\n\nCovering foundational to advanced topics—including network security, ethical hacking, encryption, and incident response—this diploma prepares students for careers in cybersecurity and related IT fields. Through hands-on labs, simulations, and real-world case studies, learners gain the confidence to tackle modern security challenges in today’s digital world.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/cyber-security_D9JJwaDwd.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:53:02.993Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687963179a9ac7907d451ac2"
  },
  "name": "Diploma in Data Analytics",
  "fees": 18000,
  "type": "Diploma",
  "discount": 69,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "13",
  "ratings": 4.7,
  "description": "The Diploma in Data Analytics is a career-focused program designed to equip learners with in-demand data skills used across industries like finance, healthcare, marketing, and e-commerce. This course covers the entire data lifecycle—from data collection and cleaning to analysis and visualization—using tools such as Excel, SQL, Python, and Tableau. You’ll gain hands-on experience working with real datasets to develop insights that support data-driven decision-making.\n\nWhether you're aiming to become a data analyst, business intelligence professional, or marketing strategist, this program helps you build a strong foundation in statistical analysis, reporting, and dashboard creation. With practical projects and guided instruction, you'll graduate ready to solve real-world problems and add value through data.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/data-analytics_kNp93iw9y.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:54:47.224Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687963749a9ac7907d451aca"
  },
  "name": "Diploma in Data Science",
  "fees": 18000,
  "type": "Diploma",
  "discount": 82,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "29",
  "ratings": 4.4,
  "description": "The Diploma in Data Science is a job-ready training program designed to teach learners how to extract valuable insights from structured and unstructured data. Covering the complete data science pipeline—including data cleaning, statistical analysis, machine learning, and data visualization—this course emphasizes hands-on practice with tools like Python, R, and SQL. Students work with real-world datasets to solve complex challenges across industries like finance, healthcare, and technology.\n\nIdeal for beginners and professionals alike, this program equips you to become a data-driven problem solver and decision-maker. By the end of the course, you'll be prepared for roles such as data scientist, machine learning engineer, or AI analyst, and ready to contribute to data-powered innovation in any organization.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/data-science_N9jpCT-Fj.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:56:20.748Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687964009a9ac7907d451ad2"
  },
  "name": "HTML",
  "fees": 2100,
  "type": "Certification",
  "discount": 30,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "79",
  "ratings": 4.4,
  "description": "Learn the building blocks of the web with our beginner-friendly HTML course. HTML (HyperText Markup Language) is the foundation of all websites and is essential for anyone interested in web development. This course teaches you how to create structured, accessible, and visually organized web pages from scratch. You’ll gain hands-on experience writing clean HTML code and learn how each element contributes to the overall layout and functionality of a website.\n\nWhether you're launching a career in web development or want to build a personal portfolio or blog, this course provides the core skills needed to get started. No prior coding experience is required—you’ll start with the basics and gradually advance to creating complete, standards-compliant pages using best practices. By the end, you’ll have a solid understanding of how the web works and the confidence to bring your ideas online.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/HTML_symr9LiHY.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:58:40.910Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6879644f9a9ac7907d451adc"
  },
  "name": "DHTML | CSS",
  "fees": 3000,
  "type": "Certification",
  "discount": 30,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "20",
  "ratings": 4.4,
  "description": "This hands-on course introduces you to DHTML (Dynamic HTML) and CSS (Cascading Style Sheets), two essential technologies for creating modern, interactive, and visually rich websites. While HTML provides the structure, DHTML combines HTML, CSS, JavaScript, and the Document Object Model (DOM) to enable dynamic behavior and real-time interactivity. CSS allows you to control layout, design, colors, and typography—making your websites not only functional but also visually engaging.\n\nThroughout the course, you'll learn how to build responsive, animated web interfaces and gain control over how elements behave and appear on different devices. Perfect for aspiring front-end developers and designers, this program equips you with the skills to craft seamless user experiences without relying heavily on external frameworks. By the end, you'll be ready to create websites that are both technically sound and visually compelling.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/DHTML___CSS_hmbhzqsSn.jpg",
  "createdAt": {
    "$date": "2025-07-17T20:59:59.913Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687964a69a9ac7907d451aea"
  },
  "name": "JavaScript",
  "fees": 3000,
  "type": "Certification",
  "discount": 49,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "17",
  "ratings": 4.2,
  "description": "JavaScript is the core scripting language that powers interactivity on the web—from form validation and dynamic animations to full-scale web applications. This beginner-friendly course provides a complete introduction to JavaScript, helping you understand its key concepts and apply them through hands-on projects. Whether you're starting out in coding or looking to boost your front-end development skills, you'll gain practical knowledge that makes websites come alive.\n\nYou'll learn to write clean, efficient JavaScript code, interact with the Document Object Model (DOM), and build features that respond to user input in real time. This course emphasizes real-world applications, preparing you to build responsive, interactive websites with confidence.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/javascript_GzsbbOSHQ.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:01:26.788Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687964e09a9ac7907d451af2"
  },
  "name": "MySQL",
  "fees": 3000,
  "type": "Certification",
  "discount": 49,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "28",
  "ratings": 4.3,
  "description": "MySQL is a powerful and widely used open-source relational database management system, essential for storing and managing structured data across web and enterprise applications. This course offers a complete introduction to MySQL, guiding you through database creation, table design, and writing effective SQL queries. Whether you're a beginner or a tech professional, you'll learn to retrieve, update, and organize data with precision and efficiency.\n\nIdeal for those looking to work with data-driven websites, backend systems, or enterprise applications, this course provides hands-on experience using MySQL in real-world scenarios. Through guided projects and practical exercises, you'll gain the skills to handle data securely and understand how relational databases drive modern software systems.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/my-sql_uTGKNSvLF.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:02:24.526Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6879652d9a9ac7907d451afa"
  },
  "name": "UI/UX Design",
  "fees": 2100,
  "type": "Certification",
  "discount": 49,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "18",
  "ratings": 4.6,
  "description": "In today’s digital-first world, UI (User Interface) and UX (User Experience) design are essential for creating websites, apps, and software that are both functional and enjoyable to use. This course provides a solid foundation in modern UI/UX design practices—covering everything from user research and wireframing to prototyping and usability testing. You’ll learn how to build user-centered digital products that not only look great but also solve real-world problems.\n\nWhether you're new to the field or transitioning from another career, this hands-on program equips you with the creative and technical skills needed to design intuitive, accessible, and engaging digital experiences. By the end of the course, you'll be ready to contribute to professional design teams or confidently launch your own design projects.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/ui-ux_YNQtBbWA9.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:03:41.184Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6879656f9a9ac7907d451b02"
  },
  "name": "PHP",
  "fees": 3000,
  "type": "Certification",
  "discount": 60,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "32",
  "ratings": 3.8,
  "description": "PHP (Hypertext Preprocessor) is one of the most widely used server-side scripting languages for building dynamic and interactive web applications. This beginner-friendly course is designed to take you from the fundamentals of PHP to building fully functional, data-driven websites. You’ll learn how PHP interacts with HTML, handles user input, connects to databases, and enables real-time web functionality.\n\nPerfect for aspiring web developers or anyone looking to strengthen their backend development skills, this course provides hands-on experience in developing login systems, form handlers, and content management features. By the end of the program, you'll be ready to create secure, responsive web applications powered by PHP and MySQL.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/PHP_NthoYDuFoR.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:04:47.314Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687965b09a9ac7907d451b0a"
  },
  "name": "WordPress",
  "fees": 4000,
  "type": "Certification",
  "discount": 48,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "28",
  "ratings": 4.2,
  "description": "WordPress is the world’s leading content management system (CMS), powering over 40% of all websites. This hands-on course is designed to teach you how to build, customize, and maintain professional websites using WordPress—without needing to write a single line of code. Whether you're creating a personal blog, a business site, or a full-fledged e-commerce platform, this course will give you the tools and confidence to make it happen.\n\nYou’ll learn how to set up your first website, choose and customize themes, install essential plugins, and manage site content through the intuitive WordPress dashboard. Perfect for beginners and professionals alike, this course also covers SEO, security, backups, and performance optimization—everything you need to successfully launch and maintain a WordPress-powered site.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/wordpress_6ZvyHRjQJ.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:05:52.676Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687965ff9a9ac7907d451b12"
  },
  "name": "Flutter",
  "fees": 4000,
  "type": "Certification",
  "discount": 69,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "23",
  "ratings": 4.5,
  "description": "Flutter is Google’s powerful open-source UI toolkit for building stunning, high-performance applications across mobile, web, and desktop—all from a single codebase. This course offers a complete introduction to Flutter and the Dart programming language, helping you build responsive, feature-rich apps with smooth animations and native performance. Whether you're a beginner in app development or looking to go cross-platform, this course gives you the tools to bring your app ideas to life.\n\nYou'll learn how to design modern UI with widgets, manage state efficiently, connect to APIs, and deploy apps to Android and iOS platforms. By combining theoretical knowledge with hands-on projects, this course prepares you to create professional-grade applications that work seamlessly across devices.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/flutter_yvN9Oorjv.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:07:11.917Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687966cf9a9ac7907d451b85"
  },
  "name": "MS Excel",
  "fees": 2000,
  "type": "Certification",
  "discount": 69,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "23",
  "ratings": 4.5,
  "description": "Microsoft Excel is a globally used spreadsheet tool essential for data analysis, reporting, and decision-making across every industry. This course offers a practical introduction to Excel, teaching you how to organize data, perform calculations, use formulas and functions, and create visually appealing charts and reports. Whether you're managing budgets, analyzing trends, or preparing presentations, Excel is an indispensable skill in today’s data-driven world.\n\nPerfect for beginners as well as those looking to sharpen their skills, this course guides you through Excel’s most powerful features—from basic formatting to advanced data tools like PivotTables, conditional formatting, and charts. By the end of the course, you'll confidently apply Excel to solve real-world problems in business, education, or personal finance.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/MS_Excel_53GBpF89j.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:10:39.077Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6879670a9a9ac7907d451b8d"
  },
  "name": "MS Word",
  "fees": 1999,
  "type": "Certification",
  "discount": 69,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "17",
  "ratings": 4.5,
  "description": "Microsoft Word is the world’s most widely used word processing tool, trusted by individuals and organizations for creating polished, professional documents. This course provides a comprehensive introduction to MS Word, covering everything from basic formatting to advanced layout techniques. You’ll learn how to create reports, letters, resumes, and more with clarity and confidence.\n\nWhether you're just starting out or looking to improve your productivity, this course equips you with the essential skills to navigate Word’s powerful features. Learn how to format text, insert tables and images, use templates, and collaborate on documents efficiently—perfect for students, professionals, and anyone who works with written content.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/MS_Word_AvKvn9JYu.jpg",
  "createdAt": {
    "$date": "2025-07-17T21:11:38.662Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a13ff75088893ab4c1658"
  },
  "name": "Diploma in Digital Marketing",
  "fees": 12000,
  "type": "Diploma",
  "discount": 0,
  "course_level": "Intermediate",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "9",
  "ratings": 4.6,
  "description": "The Diploma in Digital Marketing is an all-in-one program designed to equip students, entrepreneurs, and marketing professionals with the technical expertise and strategic mindset needed to succeed in today’s online world. This hands-on course covers the full spectrum of digital marketing, from SEO and social media to PPC, content marketing, and automation. You’ll learn how to plan, execute, and measure multi-channel campaigns that attract and convert modern consumers.\n\nWhether you're launching a new career, scaling your business, or advancing in your current role, this diploma offers real-world projects and tools that are immediately applicable across industries. Through a blend of strategy and execution, you'll gain a practical understanding of how digital channels work together to drive measurable business results.\n\nDigital Marketing Modules:\n\n• Introduction to Digital Marketing: Understand the digital marketing ecosystem, consumer behavior, and market trends.  \n• Search Engine Optimization (SEO): Learn how to improve website visibility on search engines through on-page and off-page techniques.  \n• Search Engine Marketing (SEM) & PPC: Use Google Ads and other platforms to create paid campaigns that drive traffic and conversions.  \n• Social Media Marketing: Develop strategies for platforms like Facebook, Instagram, LinkedIn, and YouTube to grow brand presence.  \n• Email Marketing: Build and manage effective email campaigns, including list building, automation, and performance analysis.  \n• Content Marketing: Create high-quality, SEO-friendly content that engages audiences and supports brand goals.  \n• Web Analytics: Use tools like Google Analytics to track, measure, and optimize digital marketing efforts.  \n• Affiliate and Influencer Marketing: Understand how to leverage third-party partners to expand reach and credibility.  \n• Mobile Marketing: Learn mobile-optimized strategies, including SMS, app promotion, and responsive design.  \n• Marketing Automation Tools: Explore tools such as HubSpot, Mailchimp, or Meta Business Suite for streamlined marketing processes.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Marketing_Strategy_lKL5xAVmoT.jpg",
  "createdAt": {
    "$date": "2025-07-18T09:29:35.115Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a15bc75088893ab4c167d"
  },
  "name": "SEO + SMO",
  "fees": 4000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "2",
  "ratings": 3.8,
  "description": "In today’s competitive digital landscape, building an online presence is only the beginning — visibility, traffic, and engagement are the true drivers of growth. This comprehensive SEO & SMO course equips learners with essential tools and strategies to boost search engine rankings and enhance social media performance. Whether you're a business owner, freelancer, content creator, or aspiring digital marketer, this course teaches you how to generate organic traffic, build brand authority, and drive consistent engagement across digital channels.\n\nYou’ll gain hands-on knowledge of on-page and off-page SEO, keyword research, technical site improvements, and social media content planning. By integrating SEO and SMO tactics with content marketing and analytics, you'll develop a unified approach to digital visibility and performance.\n\nLearn in this course:\n\n• SEO Fundamentals: Understand how search engines work and how to make your website search-friendly.  \n• Keyword Research: Discover tools and techniques to find high-performing keywords for content optimization.  \n• On-Page & Off-Page SEO: Learn to optimize website content, meta tags, URLs, and build high-quality backlinks.  \n• Technical SEO Basics: Improve site speed, mobile responsiveness, indexing, and crawlability.  \n• Social Media Strategy: Create content calendars, target the right audience, and choose the right platforms.  \n• Paid vs Organic SMM: Explore the difference between organic reach and paid advertising campaigns.  \n• Analytics & Reporting: Track performance using tools like Google Analytics and social media insights.  \n• Content Marketing Integration: Align SEO and SMM efforts with content strategies for maximum ROI.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/SEO___SMO_D5QRvTxjS7.jpg",
  "createdAt": {
    "$date": "2025-07-18T09:37:00.095Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a172875088893ab4c1689"
  },
  "name": "PPC Advertising",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "6",
  "ratings": 4.2,
  "description": "Pay-Per-Click (PPC) advertising is one of the most effective and measurable tools in digital marketing, enabling businesses to reach highly targeted audiences and generate leads with precision and speed. This comprehensive PPC Advertising course teaches you how to build, manage, and optimize campaigns across major platforms such as Google Ads, Bing, Facebook, Instagram, and LinkedIn. Whether you're a beginner or a marketing professional, you'll gain the technical and strategic skills needed to drive real return on investment through paid media.\n\nFrom conducting keyword research to writing compelling ad copy and optimizing landing pages, this hands-on course offers deep insights into every aspect of paid advertising. You'll learn to set budgets, implement conversion tracking, and continuously improve campaign performance using analytics, A/B testing, and real-world data.\n\nLearn in this course:\n\n• Introduction to PPC: Understand how PPC works, bidding models, and the role of paid advertising in digital marketing.  \n• Google Ads Mastery: Learn to create effective Search, Display, Shopping, and Video campaigns using Google Ads.  \n• Keyword Research for PPC: Discover how to identify high-intent keywords and structure ad groups effectively.  \n• Ad Copywriting: Craft compelling ad copy that drives clicks and conversions.  \n• Budgeting and Bidding Strategies: Learn how to set budgets, choose bidding strategies, and reduce cost-per-click (CPC).  \n• Conversion Tracking: Set up goals and measure campaign performance using Google Analytics and tracking pixels.  \n• Landing Page Optimization: Improve user experience and boost conversion rates through targeted landing pages.  \n• Campaign Optimization & A/B Testing: Continuously improve ad performance through data-driven testing and tweaks.  \n• PPC on Social Platforms: Explore paid advertising on Facebook, Instagram, LinkedIn, and YouTube.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/PPC-_Advertising_Y03toywt4f.jpg",
  "createdAt": {
    "$date": "2025-07-18T09:43:04.487Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a181675088893ab4c1691"
  },
  "name": "Marketing Strategy",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "3",
  "ratings": 4.2,
  "description": "In today’s competitive and fast-paced digital economy, having a strong marketing strategy is key to long-term business growth. This Strategic Marketing course offers a comprehensive look at how to build, implement, and evaluate marketing strategies that align with organizational goals. You’ll explore core concepts like market analysis, segmentation, positioning, and branding — all essential to gaining a competitive edge in global and local markets.\n\nIdeal for entrepreneurs, marketing professionals, and business leaders, this course blends theoretical foundations with practical tools and frameworks. From launching new products to scaling existing brands, you’ll develop the ability to craft customer-centric marketing strategies that drive measurable results.\n\nLearn in this course:\n\n• Foundations of Marketing Strategy: Understand the role of strategy in marketing and how it drives business growth.  \n• Market Research & Analysis: Learn how to evaluate market trends, customer needs, and competitor positioning.  \n• Segmentation, Targeting & Positioning (STP): Master the process of identifying the right audience and crafting a value proposition.  \n• Brand Strategy Development: Build a strong, consistent brand that resonates with your target market.  \n• Marketing Mix (4Ps & 7Ps): Create strategic plans across product, price, place, promotion, people, process, and physical evidence.  \n• Digital vs Traditional Strategy: Explore how to integrate both channels for maximum impact.  \n• Customer Journey Mapping: Visualize how customers interact with your brand and optimize every touchpoint.  \n• Measuring Marketing Effectiveness: Use KPIs, ROI, and analytics to evaluate and improve your strategies.  \n• Case Studies & Real-World Applications: Apply strategic thinking to real business scenarios across industries.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Marketing_Strategy_KVT8_MbLPD.jpg",
  "createdAt": {
    "$date": "2025-07-18T09:47:02.048Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a18e375088893ab4c169d"
  },
  "name": "SEO Based Content Writing",
  "fees": 3000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "7",
  "ratings": 4.3,
  "description": "Writing content is one thing — writing content that ranks on search engines and drives meaningful traffic is another. This SEO Content Writing course bridges creativity and strategy, teaching you how to create engaging, keyword-optimized content that resonates with readers and performs well in search engine results. From crafting blog posts and landing pages to writing product descriptions and web copy, you'll learn how to generate content that boosts visibility and supports digital marketing goals.\n\nDesigned for aspiring writers, marketers, and entrepreneurs, this course blends hands-on techniques with proven SEO strategies. You'll gain practical skills in keyword research, on-page optimization, and content structuring — all while developing the ability to align your writing with search intent and brand voice.\n\nLearn in this course:\n\n• Introduction to SEO Writing: Understand how search engines evaluate and rank content.  \n• Keyword Research: Learn how to find high-value keywords and incorporate them naturally into your writing.  \n• Content Planning & Strategy: Create content calendars and structure articles for SEO impact.  \n• On-Page SEO Essentials: Optimize headings, meta descriptions, URLs, and internal linking within content.  \n• Writing for User Intent: Align content with search intent to improve relevance and engagement.  \n• Content Types & Formats: Explore writing for blogs, landing pages, product pages, and more.  \n• Readability & Tone: Craft content that’s clear, compelling, and easy to read while staying SEO-friendly.  \n• Tools for SEO Writers: Use tools like Google Keyword Planner, SEMrush, Ahrefs, Surfer SEO, and Grammarly.  \n• Measuring Content Performance: Analyze traffic, rankings, and engagement using tools like Google Analytics and Search Console.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/content-writing_M3rjpevmV.jpg",
  "createdAt": {
    "$date": "2025-07-18T09:50:27.154Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a1ca475088893ab4c16d1"
  },
  "name": "MS PowerPoint",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "3",
  "ratings": 4.2,
  "description": "Microsoft PowerPoint is the industry-standard presentation tool used to create engaging, professional slideshows for business, education, and creative communication. This course offers a complete introduction to PowerPoint, showing you how to craft impactful presentations that effectively convey ideas, data, and stories. Whether you're preparing for meetings, pitches, or classroom sessions, you'll learn to use design and delivery techniques that capture your audience's attention.\n\nPerfect for beginners and professionals alike, this course covers everything from creating slides and using themes to inserting multimedia and delivering your final presentation with confidence. By mastering animations, charts, and visual tools, you’ll develop the skills to present your content clearly and persuasively in any setting.\n\nLearn in this course:\n• PowerPoint Interface & Basics: Navigate the software and understand slide layouts and templates.  \n• Creating and Designing Slides: Add text, images, shapes, and multimedia to craft visually appealing slides.  \n• Using Themes and Slide Masters: Apply and customize themes for consistent presentation design.  \n• Animations and Transitions: Add effects to enhance flow and keep the audience engaged.  \n• Working with Charts and Graphs: Visualize data effectively with PowerPoint’s chart tools.  \n• Inserting Videos and Audio: Embed multimedia elements to enrich your presentation.  \n• Slide Notes and Presenter Tools: Use notes and presenter view to deliver smoothly.  \n• Collaboration and Sharing: Work with others on presentations and share slides securely.  \n• Preparing for Delivery: Tips on rehearsing, timing, and exporting presentations.  \n• Advanced Features: Explore hyperlinks, action buttons, and interactive elements.",
  "template_image": "https://ik.imagekit.io/iufkpclvp/MS_PowerPoint_p6sjZei7Xk.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:06:28.388Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a1d3875088893ab4c16df"
  },
  "name": "MS Outlook",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "9",
  "ratings": 3.8,
  "description": "Microsoft Outlook is a leading email and personal information management tool used by professionals worldwide to streamline communication and productivity. This course provides a complete introduction to Outlook’s key features—including email organization, calendar scheduling, contact management, and task tracking. Whether you're working remotely or in an office setting, Outlook can help you stay organized, collaborate effectively, and manage your time with confidence.\n\nDesigned for both beginners and users looking to sharpen their skills, this course offers hands-on training in real-world scenarios. You’ll learn how to automate inbox management, coordinate meetings, set reminders, and connect Outlook seamlessly with other Microsoft Office tools for a more productive workflow.\n\nLearn in this course:\n• Outlook Interface & Navigation: Understand the layout and basic functions of Outlook.  \n• Managing Emails Efficiently: Send, receive, organize, and search emails using folders and rules.  \n• Calendar Management: Schedule, modify, and share appointments, meetings, and events.  \n• Contacts and Address Book: Create, edit, and organize contacts and distribution lists.  \n• Task and To-Do Lists: Track tasks, set reminders, and manage priorities.  \n• Using Flags and Categories: Prioritize emails and organize your inbox effectively.  \n• Email Security & Privacy: Learn best practices for safe email communication.  \n• Integration with Microsoft Office: Seamlessly connect Outlook with other Office apps.  \n• Customization and Settings: Personalize Outlook for your workflow and preferences.  \n• Collaboration Features: Share calendars, delegate tasks, and work with teams.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/MS_Outlook_nxet-P2rV.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:08:56.772Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a1dd375088893ab4c16e7"
  },
  "name": "Java Basic & Advanced",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "5",
  "ratings": 4.1,
  "description": "Java is a powerful, object-oriented programming language used in everything from enterprise software and Android apps to web applications and embedded systems. This comprehensive course is designed to take you from Java basics to advanced programming concepts, helping you master one of the most in-demand languages in the industry. You’ll gain hands-on experience by working through real-world coding problems and building scalable, efficient applications.\n\nWhether you're a beginner starting your coding journey or an experienced developer looking to upgrade your skills, this course offers structured, project-based learning. From mastering core syntax and OOP principles to exploring multithreading, collections, and design patterns, you'll walk away ready to build and deploy Java-based solutions confidently.\n\nLearn in this course:\n• Java Fundamentals: Learn about variables, data types, operators, control flow, and basic syntax.  \n• Object-Oriented Programming (OOP): Understand classes, objects, inheritance, polymorphism, encapsulation, and abstraction.  \n• Exception Handling: Manage errors gracefully using try-catch blocks and custom exceptions.  \n• Java Collections Framework: Work with lists, sets, maps, and queues for efficient data storage and manipulation.  \n• File I/O and Serialization: Read from and write to files, and understand object serialization.  \n• Multithreading and Concurrency: Create multi-threaded programs and manage thread synchronization.  \n• Java Streams and Lambda Expressions: Use modern Java features for functional-style programming.  \n• Design Patterns: Explore common patterns like Singleton, Factory, and Observer to write maintainable code.  \n• JDBC and Database Connectivity: Connect Java applications to databases and execute SQL queries.  \n• Java Development Tools: Use IDEs like Eclipse or IntelliJ and understand debugging and testing basics.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Java_Program_hZEvF_O9bB.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:11:31.546Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a1eef75088893ab4c16ef"
  },
  "name": "Python",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Intermediate",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "2",
  "ratings": 4,
  "description": "Python is one of the most powerful and beginner-friendly programming languages in the world—renowned for its clear syntax and versatility. This course offers a comprehensive introduction to Python programming, guiding learners from core fundamentals to advanced concepts. You’ll gain practical experience writing clean, efficient code and developing applications that range from automation scripts to web and data-driven solutions.\n\nIdeal for aspiring developers, data analysts, or anyone looking to break into tech, this course covers everything from basic syntax to working with popular libraries like NumPy and Pandas. By the end, you’ll have the skills to build real-world projects and confidently apply Python in web development, data science, machine learning, and more.\n\nLearn in this course:\n• Python Basics: Understand syntax, variables, data types, and basic input/output.  \n• Control Structures: Use conditional statements and loops to control program flow.  \n• Functions and Modules: Write reusable code with functions and organize your programs using modules.  \n• Data Structures: Work with lists, tuples, dictionaries, and sets for effective data management.  \n• File Handling: Read from and write to files for data storage and retrieval.  \n• Error Handling: Manage exceptions and write robust programs.  \n• Object-Oriented Programming: Learn classes, objects, inheritance, and encapsulation.  \n• Libraries and Frameworks: Introduction to popular Python libraries like NumPy, Pandas, and Matplotlib.  \n• Working with APIs: Fetch and process data from web services.  \n• Project Development: Build practical projects to apply your knowledge and demonstrate skills.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Python_v-ArpaCmSJ.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:16:15.725Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a207275088893ab4c16fb"
  },
  "name": "AI / Copilot",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "9",
  "ratings": 3.8,
  "description": "Artificial Intelligence (AI) is rapidly transforming the way we work, learn, and create across industries. This course provides a practical introduction to AI, with a special focus on AI-powered productivity tools like GitHub Copilot, ChatGPT, and other intelligent assistants. You’ll explore how these tools generate code, automate routine tasks, support content creation, and enhance problem-solving—reshaping modern workflows in development, design, and digital communication.\n\nWhether you're a developer, creative professional, or curious learner, this course equips you with the skills to use AI tools effectively and ethically. From integrating Copilot into your development environment to applying AI in real-world scenarios, you'll gain hands-on experience that’s immediately applicable and future-ready.\n\nLearn in this course:\n• Introduction to Artificial Intelligence: Understand AI concepts, history, and current applications.  \n• Overview of AI-powered Tools: Explore tools like GitHub Copilot, ChatGPT, and AI assistants.  \n• Using Copilot for Code Generation: Learn how to integrate and use Copilot to write, debug, and optimize code.  \n• AI in Content Creation: Discover AI applications in writing, design, and media production.  \n• Ethical AI Use: Understand the importance of responsible AI use, data privacy, and bias mitigation.  \n• Automation of Routine Tasks: Use AI to streamline workflows and increase productivity.  \n• Collaboration with AI Tools: Best practices for human-AI collaboration.  \n• Customizing AI Assistance: Tailor AI outputs for specific projects and domains.  \n• Limitations and Challenges of AI: Recognize current AI boundaries and ongoing developments.  \n• Future Trends in AI and Copilot Technologies: Stay informed about emerging innovations and career opportunities.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/cloud-computing_HcQE1sAs_.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:22:42.624Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a222075088893ab4c1716"
  },
  "name": "IOT",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "8",
  "ratings": 4.7,
  "description": "The Internet of Things (IoT) is revolutionizing how everyday devices connect, interact, and automate across homes, cities, industries, and healthcare systems. This course provides a practical introduction to IoT concepts, architecture, and technologies, helping you understand the components and communication protocols that power smart, connected environments. From sensor integration to cloud connectivity, you'll learn how to design and implement real-world IoT systems.\n\nIdeal for engineers, developers, and tech enthusiasts, the course combines foundational theory with hands-on learning using microcontrollers, cloud platforms, and popular development boards. By the end of the course, you’ll be equipped to build scalable IoT solutions and explore emerging career opportunities in the fast-growing IoT landscape.\n\nLearn in this course:\n• Fundamentals of IoT: Understand IoT architecture, components, and communication protocols.  \n• Sensors and Actuators: Learn how to interface with hardware to collect and control data.  \n• Microcontrollers and Development Boards: Work with popular boards like Arduino and Raspberry Pi.  \n• Networking and Connectivity: Explore protocols such as MQTT, HTTP, and Bluetooth.  \n• Data Management: Capture, process, and analyze IoT data using cloud services.  \n• IoT Security: Understand challenges and best practices for securing IoT devices and networks.  \n• IoT Platforms and Tools: Use platforms like AWS IoT, Azure IoT Hub, and Google Cloud IoT.  \n• Building IoT Projects: Develop practical projects like smart home automation and environmental monitoring.  \n• IoT in Industry: Explore real-world applications in manufacturing, healthcare, agriculture, and more.  \n• Future Trends and Innovations: Stay updated on emerging technologies and career opportunities in IoT.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/IOT_IPMjjt_xK.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:29:52.273Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a229275088893ab4c171e"
  },
  "name": "Cloud Computing",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "4",
  "ratings": 4.6,
  "description": "Cloud computing has transformed the way organizations and individuals manage data, applications, and infrastructure—offering on-demand, scalable resources via the internet. This course provides a comprehensive introduction to cloud computing fundamentals, including service models (IaaS, PaaS, SaaS), deployment options, and cloud architecture. You’ll gain hands-on experience in designing, deploying, and managing cloud environments using leading platforms such as AWS, Microsoft Azure, and Google Cloud.\n\nWhether you're an IT professional, system administrator, developer, or a beginner exploring the cloud space, this course will help you build essential skills in virtualization, storage, networking, and security. By the end of the program, you’ll be prepared to work confidently in cloud-based environments and contribute to modern, cloud-driven organizations.\n\nLearn in this course:\n• Introduction to Cloud Computing: Understand cloud models (IaaS, PaaS, SaaS) and deployment types (public, private, hybrid).  \n• Cloud Service Providers: Explore platforms like AWS, Microsoft Azure, and Google Cloud.  \n• Virtualization Concepts: Learn about virtual machines, containers, and resource allocation.  \n• Cloud Storage and Databases: Manage scalable storage solutions and cloud-based databases.  \n• Networking in the Cloud: Understand virtual networks, load balancing, and content delivery.  \n• Security and Compliance: Implement cloud security best practices and data privacy measures.  \n• Cloud Automation and DevOps: Use automation tools and DevOps principles for cloud management.  \n• Monitoring and Troubleshooting: Learn to monitor cloud services and resolve common issues.  \n• Cost Management: Understand pricing models and optimize cloud spending.  \n• Cloud Migration Strategies: Plan and execute migration from on-premises to cloud environments.",
  "template_image": "https://ik.imagekit.io/iufkpclvp/cloud-computing_ET0rsR2o_k.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:31:46.246Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a230575088893ab4c1726"
  },
  "name": "Cyber Security",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "8",
  "ratings": 4.6,
  "description": "In today’s hyper-connected world, protecting digital systems and sensitive information from cyber threats is more important than ever. This course offers a complete introduction to cyber security fundamentals, helping learners understand how to safeguard networks, data, and applications against malicious attacks. Whether you’re a beginner exploring the field or an IT professional aiming to enhance your security knowledge, this course provides practical training to secure digital environments.\n\nThrough real-world scenarios, hands-on tools, and guided instruction, you’ll learn to identify vulnerabilities, prevent breaches, and respond effectively to incidents. By the end of the course, you'll be equipped with essential cyber security skills and a solid understanding of the principles that drive secure systems across industries.\n\nLearn in this course:\n• Fundamentals of Cyber Security: Understand key concepts, types of cyber threats, and security goals.  \n• Network Security: Learn about firewalls, VPNs, intrusion detection systems, and secure network architecture.  \n• Cryptography Basics: Explore encryption, hashing, and digital signatures to protect data confidentiality and integrity.  \n• Vulnerability Assessment and Penetration Testing: Discover techniques to identify and exploit security weaknesses.  \n• Malware and Threat Analysis: Study common malware types and methods to detect and mitigate them.  \n• Security Policies and Compliance: Understand frameworks, standards, and legal aspects of cyber security.  \n• Incident Response and Recovery: Develop skills to handle security breaches and minimize damage.  \n• Ethical Hacking: Learn the mindset and methods of ethical hackers to strengthen defenses.  \n• Security Tools and Technologies: Get hands-on experience with popular security software and tools.  \n• Emerging Trends and Challenges: Stay updated on evolving cyber threats and defense strategies.",
  "template_image": "https://ik.imagekit.io/iufkpclvp/cyber-security_q9Ltx8EBF.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:33:41.798Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a23a375088893ab4c1737"
  },
  "name": "Data Analytics",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "3",
  "ratings": 3.7,
  "description": "Data Analytics is the science of turning raw data into actionable insights that help businesses and organizations make smarter, data-driven decisions. This course offers a practical introduction to the core concepts, tools, and techniques used in modern data analysis. From data collection and cleaning to exploration and visualization, you’ll learn how to uncover trends and patterns that lead to real-world impact.\n\nIdeal for aspiring analysts, business professionals, and decision-makers, this hands-on course emphasizes real-world applications across industries. You’ll work with tools like Excel, Power BI, and SQL while building a strong foundation in statistical analysis, data modeling, and ethical data practices.\n\nLearn in this course:\n• Introduction to Data Analytics: Understand the data analytics lifecycle and key concepts.  \n• Data Collection and Cleaning: Learn techniques to gather accurate data and prepare it for analysis.  \n• Exploratory Data Analysis (EDA): Use statistical methods to summarize and visualize data.  \n• Data Visualization: Create impactful charts, graphs, and dashboards using tools like Excel, Tableau, or Power BI.  \n• Statistical Analysis: Apply descriptive and inferential statistics to interpret data.  \n• Data Modeling: Build predictive models using regression and classification techniques.  \n• Working with Databases: Query and manipulate data using SQL.  \n• Big Data Basics: Get introduced to concepts and tools for handling large datasets.  \n• Reporting and Communication: Present data findings clearly to stakeholders.  \n• Ethics and Data Privacy: Understand responsible data use and compliance considerations.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/data-analytics_9eyI7urDXM.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:36:19.127Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a245475088893ab4c1748"
  },
  "name": "Data Science",
  "fees": 5000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "IT",
  "duration": "12 Weeks",
  "days_left": "7",
  "ratings": 4.4,
  "description": "Data Science is a rapidly growing interdisciplinary field that blends statistics, programming, and domain expertise to uncover insights and make predictions from complex datasets. This course provides a comprehensive introduction to data science fundamentals, guiding learners through data collection, cleaning, exploration, and predictive modeling using machine learning. You’ll work with real-world examples and datasets to build practical skills that apply across industries—from healthcare and finance to marketing and tech.\n\nIdeal for both beginners and professionals, this hands-on course emphasizes the tools and techniques used by data scientists every day. You’ll gain experience with Python or R, explore machine learning algorithms, and develop the ability to communicate findings through visualizations and reports, equipping you to drive data-driven decisions in any organization.\n\nLearn in this course:\n• Fundamentals of Data Science: Understand the data science process and key terminology.  \n• Data Collection and Preparation: Techniques to gather and clean data for analysis.  \n• Exploratory Data Analysis (EDA): Use statistical methods and visualization to explore data.  \n• Programming for Data Science: Learn Python or R for data manipulation and analysis.  \n• Machine Learning Basics: Introduction to supervised and unsupervised learning algorithms.  \n• Data Visualization: Create meaningful visual representations using tools like Matplotlib, Seaborn, or Tableau.  \n• Statistical Inference: Apply probability and statistics to interpret data results.  \n• Big Data Technologies: Overview of handling large datasets using tools like Hadoop and Spark.  \n• Model Evaluation and Optimization: Techniques to assess and improve predictive models.  \n• Communication and Reporting: Present data insights effectively to technical and non-technical audiences.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/data-science__lgleUVGf.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:39:16.357Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a24d975088893ab4c1756"
  },
  "name": "Diploma in QMS & PMP",
  "fees": 12000,
  "type": "Diploma",
  "discount": 0,
  "course_level": "Intermediate",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "7",
  "ratings": 3.8,
  "description": "This diploma program offers a powerful dual specialization in Quality Management Systems (QMS) and Project Management Professional (PMP) methodologies, equipping learners with the tools to lead both quality assurance initiatives and complex projects across industries. Designed for aspiring managers, engineers, and quality professionals, the course blends ISO 9001 standards with the PMI-based PMP framework to deliver globally relevant, industry-recognized expertise.\n\nParticipants will learn to design and implement robust quality systems while mastering the full project lifecycle—from initiation to closure. Whether your goal is process excellence or project delivery success, this course prepares you for leadership roles by combining structured systems thinking with agile, practical execution strategies.\n\nLearn in this course:\n\nQuality Management Systems (QMS)  \n• Principles and importance of quality management  \n• Understanding ISO 9001:2015 standards and compliance  \n• Developing and implementing quality policies and procedures  \n• Conducting internal audits and corrective actions  \n• Risk-based thinking and continual improvement  \n• Customer satisfaction and performance measurement  \n• Documentation, quality manuals, and process mapping  \n\nProject Management Professional (PMP)  \n• Project lifecycle and process groups (Initiating, Planning, Executing, Monitoring, Closing)  \n• Integration, scope, time, cost, and quality management  \n• Risk management and mitigation strategies  \n• Stakeholder and communication management  \n• Agile and hybrid project methodologies  \n• Leadership, team building, and resource allocation  \n• Tools such as Gantt charts, critical path method (CPM), and Earned Value Management (EVM)  \n• Preparation for the PMP certification exam (based on PMI PMBOK® Guide)\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/QMS___PMP_wDvwGcGBR.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:41:29.176Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a274675088893ab4c175e"
  },
  "name": "Six Sigma",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "7",
  "ratings": 3.8,
  "description": "The Six Sigma course is designed to provide professionals with a thorough understanding of quality management and process improvement strategies. Centered around the DMAIC (Define, Measure, Analyze, Improve, Control) methodology, Six Sigma emphasizes data-driven decision-making, root cause analysis, and statistical tools to minimize defects and improve efficiency across business processes.\n\nIdeal for quality managers, analysts, and operations professionals, this course equips learners with practical tools to reduce waste, optimize workflows, and enhance customer satisfaction. Through real-world case studies and project-based learning, participants will gain the skills needed to lead or support impactful quality initiatives in any organization.\n\nLearn in this course:\n\nSix Sigma  \n• Introduction to Six Sigma: Fundamentals, history, and benefits of Six Sigma in various industries.  \n• DMAIC Methodology: Detailed exploration of each phase — Define, Measure, Analyze, Improve, Control.  \n• Process Mapping and Analysis: Tools for understanding workflows and identifying bottlenecks.  \n• Statistical Tools for Quality Improvement: Use of control charts, hypothesis testing, regression analysis, and more.  \n• Root Cause Analysis Techniques: Methods like Fishbone Diagram, 5 Whys, and Failure Mode Effects Analysis (FMEA).  \n• Lean Principles: Integrating Lean concepts to eliminate waste and optimize processes.  \n• Project Management for Six Sigma: Planning, executing, and managing improvement projects.  \n• Change Management and Stakeholder Engagement: Strategies to ensure successful adoption of process improvements.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Six_Sigma_iFfC9637d.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:51:50.922Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a27a575088893ab4c1766"
  },
  "name": "HR Management",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "6",
  "ratings": 3.8,
  "description": "The Human Resource (HR) Management course is designed to provide learners with a practical and comprehensive understanding of how to manage and develop an organization’s most valuable asset—its people. Covering all core HR functions, this course equips participants with the skills needed to handle recruitment, performance management, employee engagement, training and development, and labor law compliance effectively.\n\nWhether you're starting a career in HR or a manager looking to lead people more effectively, this course offers real-world tools and insights to build a high-performing workforce. Through interactive sessions and case-based learning, you’ll develop the ability to foster a productive workplace culture, resolve conflicts, and support strategic business growth.\n\nLearn in this course:\n\nHuman Resource Management  \n• Introduction to Human Resource Management: Understanding the role and importance of HR in organizations.  \n• Recruitment and Selection: Techniques for attracting, interviewing, and hiring the right talent.  \n• Employee Onboarding and Training: Designing effective orientation and continuous learning programs.  \n• Performance Management: Setting goals, conducting appraisals, and providing constructive feedback.  \n• Compensation and Benefits: Understanding salary structures, incentives, and employee benefits.  \n• Labor Laws and Compliance: Key legal regulations and ethical considerations in HR practices.  \n• Employee Relations and Conflict Resolution: Building a positive work environment and handling workplace disputes.  \n• Talent Management and Succession Planning: Strategies for employee retention and leadership development.  \n• HR Analytics: Using data to make informed HR decisions and improve workforce planning.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/HR_Management_iZDMkcROPM.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:53:25.130Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a280775088893ab4c176e"
  },
  "name": "ISO 9001:2015",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "5",
  "ratings": 3.9,
  "description": "The ISO 9001:2015 course delivers in-depth training on the world’s most recognized standard for Quality Management Systems (QMS). Designed to help organizations consistently meet customer and regulatory requirements, this course guides participants through the core structure, principles, and clauses of the ISO 9001:2015 standard. You'll learn how to develop, implement, and maintain a QMS that promotes efficiency, compliance, and continuous improvement.\n\nWhether you're part of a quality team, leading compliance initiatives, or preparing for certification, this course equips you with the practical skills and tools needed to align business processes with ISO standards. Through real-world examples and internal audit techniques, learners will be prepared to support quality assurance at every level of the organization.\n\nLearn in this course:\n\nISO 9001:2015 Quality Management Systems  \n• Introduction to ISO 9001:2015: Understanding the purpose, scope, and benefits of the standard.  \n• Key Principles of Quality Management: Customer focus, leadership, engagement of people, process approach, improvement, evidence-based decision making, and relationship management.  \n• ISO 9001:2015 Requirements: Detailed review of clauses including context of the organization, leadership, planning, support, operation, performance evaluation, and improvement.  \n• Documenting the Quality Management System: Creating quality manuals, procedures, work instructions, and records.  \n• Implementation Strategies: Steps to implement ISO 9001:2015 in various organizational contexts.  \n• Internal Auditing: Techniques and tools for planning, conducting, and reporting audits.  \n• Continuous Improvement and Corrective Actions: Methods to identify non-conformities and implement effective corrective measures.  \n• Certification Process: Guidance on preparing for external audits and achieving ISO 9001 certification.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/ISO_-p9B-89551.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:55:03.674Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a287f75088893ab4c1776"
  },
  "name": "PMP",
  "fees": 3000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "3",
  "ratings": 4.2,
  "description": "The PMP Certification Training course is designed to help aspiring and experienced project managers prepare for the globally respected Project Management Professional (PMP) credential from the Project Management Institute (PMI). This program provides comprehensive coverage of PMI’s latest standards and project management methodologies, offering participants the tools and confidence to lead projects across any industry with success.\n\nLearners will explore the five process groups—Initiating, Planning, Executing, Monitoring & Controlling, and Closing—as well as the ten knowledge areas critical to effective project delivery. With real-world case studies, hands-on tools, and targeted exam strategies, this course not only prepares participants to pass the PMP exam but also equips them with best practices to drive organizational results through structured project management.\n\nLearn in this course:\n\nProject Management (PMP)  \n• Project Management Framework: Understanding PMI’s standards, project life cycle, and organizational influences.  \n• Project Integration Management: How to develop project charters, project management plans, and manage project execution.  \n• Scope, Time, and Cost Management: Techniques for defining scope, creating schedules, and managing budgets effectively.  \n• Quality and Resource Management: Ensuring deliverables meet quality standards and managing project teams.  \n• Communication and Stakeholder Management: Effective communication plans and managing stakeholder expectations.  \n• Risk Management: Identifying, analyzing, and responding to project risks.  \n• Procurement Management: Managing contracts, vendor relationships, and procurement processes.  \n• Project Monitoring and Control: Tracking progress, managing changes, and ensuring project objectives are met.  \n• PMP Exam Preparation: Tips, practice questions, and strategies for successfully passing the PMP exam.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/PMP_wws2Medzk2.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:57:03.108Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a28f675088893ab4c177e"
  },
  "name": "Videography",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "4",
  "ratings": 4.1,
  "description": "The Videography course offers a creative and technical introduction to producing professional-quality video content across multiple formats. Whether you're aiming to create films, social media reels, documentaries, or marketing videos, this course equips you with the skills to visually tell stories that captivate and engage audiences. You’ll explore camera operations, composition, lighting, audio recording, and post-production editing — all critical elements of successful video production.\n\nWith a strong focus on hands-on practice, learners will apply techniques through guided projects that reflect real-world media production scenarios. By the end of the course, you’ll be confident in managing a video project from concept to final cut and prepared for roles in filmmaking, content creation, or corporate media production.\n\nLearn in this course:\n\nVideography  \n• Basics of Videography: Understanding camera types, lenses, and settings.  \n• Video Composition and Framing: Techniques for effective shot selection, angles, and storytelling.  \n• Lighting Techniques: How to use natural and artificial light to enhance video quality.  \n• Sound Recording and Microphone Use: Capturing clear audio to complement your visuals.  \n• Camera Movements and Techniques: Mastering panning, tracking, tilting, and handheld shooting.  \n• Video Editing Fundamentals: Using editing software to trim, arrange, and enhance footage.  \n• Color Correction and Grading: Adjusting colors to set mood and consistency.  \n• Storyboarding and Planning: Preparing and organizing your shoots for smooth production.  \n• Project Workflow and Delivery: Exporting videos in different formats and platforms.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Videography_4j02pVLSaY.jpg",
  "createdAt": {
    "$date": "2025-07-18T10:59:02.895Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a296a75088893ab4c1796"
  },
  "name": "Personal Branding / Modelling",
  "fees": 3000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "5",
  "ratings": 4.2,
  "description": "The Personal Branding & Modelling course is a unique blend of self-image development and professional modelling skills designed to help individuals stand out in today’s competitive, image-driven world. Whether you aspire to become a model, public figure, influencer, or simply want to refine your personal presentation, this course teaches you how to craft a compelling personal brand while mastering the fundamentals of modelling.\n\nParticipants will gain hands-on experience in posing, runway walking, and building a modelling portfolio, while also learning confidence-building strategies, grooming techniques, and how to present themselves authentically across platforms. From photo shoots to social media branding, this course equips you with the tools to grow your visibility, network effectively, and navigate the modelling industry with confidence.\n\nLearn in this course:\n\nPersonal Branding & Modelling  \n• Understanding Personal Branding: Crafting a unique personal identity and communicating your values effectively.  \n• Building Confidence and Presence: Techniques to enhance self-esteem, body language, and public speaking.  \n• Professional Grooming and Style: Tips on skincare, makeup, fashion, and wardrobe planning aligned with your brand.  \n• Modelling Fundamentals: Posing techniques, facial expressions, and movement for photo shoots and runway.  \n• Portfolio Development: Creating impactful modelling portfolios and comp cards.  \n• Social Media for Personal Branding: Leveraging platforms to grow your audience and showcase your brand.  \n• Networking and Industry Insights: Connecting with agents, photographers, and casting directors.  \n• Career Management: Navigating contracts, auditions, and building long-term success.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Personal_Branding_Modelling_xJEbmXs3zP.jpg",
  "createdAt": {
    "$date": "2025-07-18T11:00:58.757Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a29da75088893ab4c179e"
  },
  "name": "Video & Photography Editing",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "7",
  "ratings": 4.2,
  "description": "The Video & Photography Editing course is designed to help aspiring editors, creators, and marketers turn raw visuals into stunning, professional-grade content. Covering both video and photo editing essentials, this course teaches you how to use industry-standard software to enhance footage, apply creative effects, and tell visual stories that captivate your audience. Whether you're creating content for YouTube, social media, marketing, or personal projects, you’ll gain practical editing skills that bring your ideas to life.\n\nThrough hands-on projects and expert-led instruction, you’ll explore advanced editing tools, refine your creative eye, and build a portfolio that showcases your talent. From basic corrections to dynamic visual storytelling, this course is ideal for content creators, photographers, videographers, and digital marketers alike.\n\nLearn in this course:\n\nPhoto & Video Editing  \n• Introduction to Editing Software: Overview of popular tools like Adobe Premiere Pro, Final Cut Pro, Adobe Photoshop, and Lightroom.  \n• Basic and Advanced Video Editing Techniques: Cutting, trimming, transitions, layering, color correction, and audio editing.  \n• Photo Editing Fundamentals: Retouching, color grading, cropping, and enhancing images for various uses.  \n• Creative Effects and Filters: Applying visual effects, motion graphics, and special filters to elevate your content.  \n• Workflow and Project Management: Organizing files, timelines, and efficient editing practices.  \n• Exporting and Sharing: Optimizing videos and photos for different platforms and formats.  \n• Storytelling Through Editing: Crafting narratives and pacing that captivate viewers.  \n• Practical Editing Projects: Real-world exercises to build your portfolio and confidence.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Videography___Photography_pXmfQCo93R.jpg",
  "createdAt": {
    "$date": "2025-07-18T11:02:50.884Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a2a3d75088893ab4c17a6"
  },
  "name": "Photography",
  "fees": 2000,
  "type": "Certification",
  "discount": 0,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "8",
  "ratings": 4.3,
  "description": "The Photography course offers a complete introduction to the technical and creative aspects of capturing compelling images. Whether you're shooting portraits, landscapes, wildlife, or street scenes, this course equips you with the knowledge and hands-on experience to take professional-quality photos. You'll learn the essential camera functions, exposure settings, lighting principles, and compositional techniques that form the foundation of great photography.\n\nPerfect for beginners and hobbyists looking to build confidence behind the lens, the course combines theory with real-world practice. You'll also explore creative effects, editing basics, and visual storytelling techniques to develop your personal style and build a professional portfolio.\n\nLearn in this course:\n\nPhotography  \n• Camera Basics and Settings: Understanding exposure, aperture, shutter speed, ISO, and focus.  \n• Composition Techniques: Rule of thirds, framing, leading lines, and perspective.  \n• Lighting Fundamentals: Using natural and artificial light to enhance your shots.  \n• Types of Photography: Exploring portrait, landscape, macro, wildlife, and street photography.  \n• Creative Techniques: Long exposure, motion blur, depth of field, and black & white photography.  \n• Photo Editing Basics: Introduction to editing tools and enhancing your images.  \n• Storytelling Through Photography: Capturing moments that convey emotion and narrative.  \n• Building a Photography Portfolio: Showcasing your best work professionally.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Photography_FV5yNaXg5.jpg",
  "createdAt": {
    "$date": "2025-07-18T11:04:29.379Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "687a2b7275088893ab4c17ae"
  },
  "name": "Logo Design",
  "fees": 2000,
  "type": "Certification",
  "discount": 23,
  "course_level": "Beginner",
  "category": "NON IT",
  "duration": "12 Weeks",
  "days_left": "6",
  "ratings": 4.7,
  "description": "The Logo Design course is tailored to help aspiring designers master the art of crafting memorable, brand-focused logos. Whether you're designing for businesses, personal brands, or products, this course walks you through the full creative process—from initial concepts and sketching to digital execution and client delivery. You’ll learn to balance aesthetics with function, creating logos that resonate with target audiences while representing a brand’s identity with clarity and creativity.\n\nPerfect for beginners or graphic designers looking to specialize, the program emphasizes industry best practices in typography, color theory, layout, and client communication. Through hands-on projects and expert guidance, you’ll gain the tools to create versatile logos that work seamlessly across digital and print platforms.\n\nLearn in this course:\n\nLogo Design  \n• Fundamentals of Logo Design: Understanding different types of logos and their purposes.  \n• Design Principles: Balance, contrast, alignment, repetition, and simplicity in logo creation.  \n• Color Theory and Typography: Choosing the right colors and fonts to convey brand personality.  \n• Concept Development and Sketching: Techniques for brainstorming and visualizing ideas.  \n• Digital Tools and Software: Hands-on training with Adobe Illustrator, CorelDRAW, or other vector-based programs.  \n• Creating Versatile Logos: Designing logos that work across various platforms and sizes.  \n• Client Communication and Feedback: Managing revisions and delivering professional presentations.  \n• Brand Identity Integration: How logos fit within broader branding strategies.\n",
  "template_image": "https://ik.imagekit.io/iufkpclvp/Logo_Design_kNGrjVzdxU.jpg",
  "createdAt": {
    "$date": "2025-07-18T11:09:38.268Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6881b8d443f5c2e74b273158"
  },
  "name": "Advanced Python Bootcamp",
  "fees": 4000,
  "type": "online",
  "discount": 20,
  "course_level": "Advanced",
  "category": "Programming",
  "duration": "12 weeks",
  "days_left": "30",
  "ratings": 4.8,
  "description": "An in-depth bootcamp for experienced programmers.",
  "template_image": "https://yourcdn.com/images/python_bootcamp.png",
  "createdAt": {
    "$date": "2025-07-24T04:38:44.147Z"
  },
  "__v": 0
}]